https://pandas.pydata.org/pandas-docs/stable/getting_started/10min.html

In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range('20130101', periods = 6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6, 4), index = dates, columns = list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.440819 -2.013385 -1.190420  0.144400
2013-01-02  0.565948  0.089923  0.843737  0.192067
2013-01-03 -1.154216 -0.733560  0.316574 -0.773809
2013-01-04 -0.690598  0.450076 -1.493416 -0.525331
2013-01-05  1.050232 -0.213513  0.402373 -0.108803
2013-01-06 -0.174387  0.462448  0.920576  0.015525

In [6]:
df2 = pd.DataFrame({'A': 1.,
                   'B': pd.Timestamp('20130102'),
                   'C': pd.Series(1, index = list(range(4)), dtype = 'float32'),
                   'D': np.array([3] * 4, dtype = 'int32'),
                   'E': pd.Categorical(['test', 'train', 'test', 'train']), 
                   'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [7]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       4 non-null      datetime64[ns]
 2   C       4 non-null      float32
 3   D       4 non-null      int32
 4   E       4 non-null      category
 5   F       4 non-null      object
dtypes: category(1), datetime64[ns](1), float32(1), float64(1), int32(1), object(1)
memory usage: 260.0+ bytes

In [12]:
df.head()

                   A         B         C         D
2013-01-01  0.440819 -2.013385 -1.190420  0.144400
2013-01-02  0.565948  0.089923  0.843737  0.192067
2013-01-03 -1.154216 -0.733560  0.316574 -0.773809
2013-01-04 -0.690598  0.450076 -1.493416 -0.525331
2013-01-05  1.050232 -0.213513  0.402373 -0.108803

In [13]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.690598  0.450076 -1.493416 -0.525331
2013-01-05  1.050232 -0.213513  0.402373 -0.108803
2013-01-06 -0.174387  0.462448  0.920576  0.015525

In [14]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [18]:
df_np = df.to_numpy()
df_np

array([[ 0.44081917, -2.01338526, -1.19042   ,  0.14440028],
       [ 0.56594836,  0.08992259,  0.84373664,  0.19206715],
       [-1.15421616, -0.73355984,  0.31657403, -0.77380939],
       [-0.69059774,  0.45007643, -1.49341622, -0.52533097],
       [ 1.05023224, -0.2135128 ,  0.40237283, -0.10880297],
       [-0.17438702,  0.46244794,  0.92057631,  0.01552536]])

In [19]:
df_np.shape

(6, 4)

In [20]:
df2_np = df2.to_numpy()
df2_np

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [21]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.006300 -0.326335 -0.033429 -0.175992
std    0.831495  0.940528  1.045195  0.389547
min   -1.154216 -2.013385 -1.493416 -0.773809
25%   -0.561545 -0.603548 -0.813671 -0.421199
50%    0.133216 -0.061795  0.359473 -0.046639
75%    0.534666  0.360038  0.733396  0.112182
max    1.050232  0.462448  0.920576  0.192067

In [22]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.440819    0.565948   -1.154216   -0.690598    1.050232   -0.174387
B   -2.013385    0.089923   -0.733560    0.450076   -0.213513    0.462448
C   -1.190420    0.843737    0.316574   -1.493416    0.402373    0.920576
D    0.144400    0.192067   -0.773809   -0.525331   -0.108803    0.015525

In [23]:
df.sort_index(axis = 1, ascending = False)

                   D         C         B         A
2013-01-01  0.144400 -1.190420 -2.013385  0.440819
2013-01-02  0.192067  0.843737  0.089923  0.565948
2013-01-03 -0.773809  0.316574 -0.733560 -1.154216
2013-01-04 -0.525331 -1.493416  0.450076 -0.690598
2013-01-05 -0.108803  0.402373 -0.213513  1.050232
2013-01-06  0.015525  0.920576  0.462448 -0.174387

In [24]:
df.sort_index(axis = 1, ascending = True)

                   A         B         C         D
2013-01-01  0.440819 -2.013385 -1.190420  0.144400
2013-01-02  0.565948  0.089923  0.843737  0.192067
2013-01-03 -1.154216 -0.733560  0.316574 -0.773809
2013-01-04 -0.690598  0.450076 -1.493416 -0.525331
2013-01-05  1.050232 -0.213513  0.402373 -0.108803
2013-01-06 -0.174387  0.462448  0.920576  0.015525

In [25]:
df.sort_index(axis = 0, ascending = False)

                   A         B         C         D
2013-01-06 -0.174387  0.462448  0.920576  0.015525
2013-01-05  1.050232 -0.213513  0.402373 -0.108803
2013-01-04 -0.690598  0.450076 -1.493416 -0.525331
2013-01-03 -1.154216 -0.733560  0.316574 -0.773809
2013-01-02  0.565948  0.089923  0.843737  0.192067
2013-01-01  0.440819 -2.013385 -1.190420  0.144400

In [26]:
df.sort_values(by = 'B')

                   A         B         C         D
2013-01-01  0.440819 -2.013385 -1.190420  0.144400
2013-01-03 -1.154216 -0.733560  0.316574 -0.773809
2013-01-05  1.050232 -0.213513  0.402373 -0.108803
2013-01-02  0.565948  0.089923  0.843737  0.192067
2013-01-04 -0.690598  0.450076 -1.493416 -0.525331
2013-01-06 -0.174387  0.462448  0.920576  0.015525

In [27]:
df.sort_values(by = 'C')

                   A         B         C         D
2013-01-04 -0.690598  0.450076 -1.493416 -0.525331
2013-01-01  0.440819 -2.013385 -1.190420  0.144400
2013-01-03 -1.154216 -0.733560  0.316574 -0.773809
2013-01-05  1.050232 -0.213513  0.402373 -0.108803
2013-01-02  0.565948  0.089923  0.843737  0.192067
2013-01-06 -0.174387  0.462448  0.920576  0.015525

In [29]:
df['C'].astype('int')

2013-01-01   -1
2013-01-02    0
2013-01-03    0
2013-01-04   -1
2013-01-05    0
2013-01-06    0
Freq: D, Name: C, dtype: int64

In [30]:
df

                   A         B         C         D
2013-01-01  0.440819 -2.013385 -1.190420  0.144400
2013-01-02  0.565948  0.089923  0.843737  0.192067
2013-01-03 -1.154216 -0.733560  0.316574 -0.773809
2013-01-04 -0.690598  0.450076 -1.493416 -0.525331
2013-01-05  1.050232 -0.213513  0.402373 -0.108803
2013-01-06 -0.174387  0.462448  0.920576  0.015525

In [31]:
df['A']

2013-01-01    0.440819
2013-01-02    0.565948
2013-01-03   -1.154216
2013-01-04   -0.690598
2013-01-05    1.050232
2013-01-06   -0.174387
Freq: D, Name: A, dtype: float64

In [32]:
df.A

2013-01-01    0.440819
2013-01-02    0.565948
2013-01-03   -1.154216
2013-01-04   -0.690598
2013-01-05    1.050232
2013-01-06   -0.174387
Freq: D, Name: A, dtype: float64

In [33]:
df[0:3]

                   A         B         C         D
2013-01-01  0.440819 -2.013385 -1.190420  0.144400
2013-01-02  0.565948  0.089923  0.843737  0.192067
2013-01-03 -1.154216 -0.733560  0.316574 -0.773809

In [34]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.565948  0.089923  0.843737  0.192067
2013-01-03 -1.154216 -0.733560  0.316574 -0.773809
2013-01-04 -0.690598  0.450076 -1.493416 -0.525331

In [35]:
df.loc[dates[0]]

A    0.440819
B   -2.013385
C   -1.190420
D    0.144400
Name: 2013-01-01 00:00:00, dtype: float64

In [37]:
df.loc[:, list('AB')]

                   A         B
2013-01-01  0.440819 -2.013385
2013-01-02  0.565948  0.089923
2013-01-03 -1.154216 -0.733560
2013-01-04 -0.690598  0.450076
2013-01-05  1.050232 -0.213513
2013-01-06 -0.174387  0.462448

In [38]:
df.loc['20130102':'20130104', list('AB')]

                   A         B
2013-01-02  0.565948  0.089923
2013-01-03 -1.154216 -0.733560
2013-01-04 -0.690598  0.450076

In [39]:
df.loc['20130102', list('AB')]

A    0.565948
B    0.089923
Name: 2013-01-02 00:00:00, dtype: float64

In [40]:
df.loc[dates[0], 'A']

0.4408191712345539

In [42]:
df.at[dates[0], 'A']

0.4408191712345539

In [43]:
df.iloc[3]

A   -0.690598
B    0.450076
C   -1.493416
D   -0.525331
Name: 2013-01-04 00:00:00, dtype: float64

In [44]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.690598  0.450076
2013-01-05  1.050232 -0.213513

In [45]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  0.565948  0.843737
2013-01-03 -1.154216  0.316574
2013-01-05  1.050232  0.402373

In [46]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -2.013385 -1.190420
2013-01-02  0.089923  0.843737
2013-01-03 -0.733560  0.316574
2013-01-04  0.450076 -1.493416
2013-01-05 -0.213513  0.402373
2013-01-06  0.462448  0.920576

In [47]:
df.iloc[1, 1]

0.08992259183256002

In [48]:
df.iat[1, 1]

0.08992259183256002

In [49]:
df['A'] > 0

2013-01-01     True
2013-01-02     True
2013-01-03    False
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: A, dtype: bool

In [50]:
df[df['A'] > 0]

                   A         B         C         D
2013-01-01  0.440819 -2.013385 -1.190420  0.144400
2013-01-02  0.565948  0.089923  0.843737  0.192067
2013-01-05  1.050232 -0.213513  0.402373 -0.108803

In [51]:
df > 0

                A      B      C      D
2013-01-01   True  False  False   True
2013-01-02   True   True   True   True
2013-01-03  False  False   True  False
2013-01-04  False   True  False  False
2013-01-05   True  False   True  False
2013-01-06  False   True   True   True

In [52]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.440819       NaN       NaN  0.144400
2013-01-02  0.565948  0.089923  0.843737  0.192067
2013-01-03       NaN       NaN  0.316574       NaN
2013-01-04       NaN  0.450076       NaN       NaN
2013-01-05  1.050232       NaN  0.402373       NaN
2013-01-06       NaN  0.462448  0.920576  0.015525

In [53]:
df2 = df.copy()

In [54]:
df2

                   A         B         C         D
2013-01-01  0.440819 -2.013385 -1.190420  0.144400
2013-01-02  0.565948  0.089923  0.843737  0.192067
2013-01-03 -1.154216 -0.733560  0.316574 -0.773809
2013-01-04 -0.690598  0.450076 -1.493416 -0.525331
2013-01-05  1.050232 -0.213513  0.402373 -0.108803
2013-01-06 -0.174387  0.462448  0.920576  0.015525

In [55]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01  0.440819 -2.013385 -1.190420  0.144400    one
2013-01-02  0.565948  0.089923  0.843737  0.192067    one
2013-01-03 -1.154216 -0.733560  0.316574 -0.773809    two
2013-01-04 -0.690598  0.450076 -1.493416 -0.525331  three
2013-01-05  1.050232 -0.213513  0.402373 -0.108803   four
2013-01-06 -0.174387  0.462448  0.920576  0.015525  three

In [56]:
df

                   A         B         C         D
2013-01-01  0.440819 -2.013385 -1.190420  0.144400
2013-01-02  0.565948  0.089923  0.843737  0.192067
2013-01-03 -1.154216 -0.733560  0.316574 -0.773809
2013-01-04 -0.690598  0.450076 -1.493416 -0.525331
2013-01-05  1.050232 -0.213513  0.402373 -0.108803
2013-01-06 -0.174387  0.462448  0.920576  0.015525

In [57]:
df2['E'].isin(['two', 'four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [58]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03 -1.154216 -0.733560  0.316574 -0.773809   two
2013-01-05  1.050232 -0.213513  0.402373 -0.108803  four

In [60]:
s1 = pd.Series([1, 2, 3, 4, 5 , 6], index = pd.date_range('20130102' ,periods = 6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [61]:
df['F'] = s1
df

                   A         B         C         D    F
2013-01-01  0.440819 -2.013385 -1.190420  0.144400  NaN
2013-01-02  0.565948  0.089923  0.843737  0.192067  1.0
2013-01-03 -1.154216 -0.733560  0.316574 -0.773809  2.0
2013-01-04 -0.690598  0.450076 -1.493416 -0.525331  3.0
2013-01-05  1.050232 -0.213513  0.402373 -0.108803  4.0
2013-01-06 -0.174387  0.462448  0.920576  0.015525  5.0

In [62]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
 4   F       5 non-null      float64
dtypes: float64(5)
memory usage: 448.0 bytes

In [63]:
df.loc[dates[0], 'A'] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000 -2.013385 -1.190420  0.144400  NaN
2013-01-02  0.565948  0.089923  0.843737  0.192067  1.0
2013-01-03 -1.154216 -0.733560  0.316574 -0.773809  2.0
2013-01-04 -0.690598  0.450076 -1.493416 -0.525331  3.0
2013-01-05  1.050232 -0.213513  0.402373 -0.108803  4.0
2013-01-06 -0.174387  0.462448  0.920576  0.015525  5.0

In [64]:
df.iloc[0, 1] = 0

In [65]:
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000 -1.190420  0.144400  NaN
2013-01-02  0.565948  0.089923  0.843737  0.192067  1.0
2013-01-03 -1.154216 -0.733560  0.316574 -0.773809  2.0
2013-01-04 -0.690598  0.450076 -1.493416 -0.525331  3.0
2013-01-05  1.050232 -0.213513  0.402373 -0.108803  4.0
2013-01-06 -0.174387  0.462448  0.920576  0.015525  5.0

In [66]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [67]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.190420  5  NaN
2013-01-02  0.565948  0.089923  0.843737  5  1.0
2013-01-03 -1.154216 -0.733560  0.316574  5  2.0
2013-01-04 -0.690598  0.450076 -1.493416  5  3.0
2013-01-05  1.050232 -0.213513  0.402373  5  4.0
2013-01-06 -0.174387  0.462448  0.920576  5  5.0

In [68]:
df2 = df.copy()

In [69]:
df2 > 0

                A      B      C     D      F
2013-01-01  False  False  False  True  False
2013-01-02   True   True   True  True   True
2013-01-03  False  False   True  True   True
2013-01-04  False   True  False  True   True
2013-01-05   True  False   True  True   True
2013-01-06  False   True   True  True   True

In [70]:
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.190420 -5  NaN
2013-01-02 -0.565948 -0.089923 -0.843737 -5 -1.0
2013-01-03 -1.154216 -0.733560 -0.316574 -5 -2.0
2013-01-04 -0.690598 -0.450076 -1.493416 -5 -3.0
2013-01-05 -1.050232 -0.213513 -0.402373 -5 -4.0
2013-01-06 -0.174387 -0.462448 -0.920576 -5 -5.0

In [71]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.190420  5  NaN
2013-01-02  0.565948  0.089923  0.843737  5  1.0
2013-01-03 -1.154216 -0.733560  0.316574  5  2.0
2013-01-04 -0.690598  0.450076 -1.493416  5  3.0
2013-01-05  1.050232 -0.213513  0.402373  5  4.0
2013-01-06 -0.174387  0.462448  0.920576  5  5.0

In [72]:
df1 = df.reindex(index = dates[0:4], columns = list(df.columns) + ['E'])
df1

                   A         B         C  D    F   E
2013-01-01  0.000000  0.000000 -1.190420  5  NaN NaN
2013-01-02  0.565948  0.089923  0.843737  5  1.0 NaN
2013-01-03 -1.154216 -0.733560  0.316574  5  2.0 NaN
2013-01-04 -0.690598  0.450076 -1.493416  5  3.0 NaN

In [73]:
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -1.190420  5  NaN  1.0
2013-01-02  0.565948  0.089923  0.843737  5  1.0  1.0
2013-01-03 -1.154216 -0.733560  0.316574  5  2.0  NaN
2013-01-04 -0.690598  0.450076 -1.493416  5  3.0  NaN

In [74]:
df1.dropna(how = 'any')

                   A         B         C  D    F    E
2013-01-02  0.565948  0.089923  0.843737  5  1.0  1.0

In [76]:
df1.fillna(value = 5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -1.190420  5  5.0  1.0
2013-01-02  0.565948  0.089923  0.843737  5  1.0  1.0
2013-01-03 -1.154216 -0.733560  0.316574  5  2.0  5.0
2013-01-04 -0.690598  0.450076 -1.493416  5  3.0  5.0

In [77]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [78]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.190420  5  NaN
2013-01-02  0.565948  0.089923  0.843737  5  1.0
2013-01-03 -1.154216 -0.733560  0.316574  5  2.0
2013-01-04 -0.690598  0.450076 -1.493416  5  3.0
2013-01-05  1.050232 -0.213513  0.402373  5  4.0
2013-01-06 -0.174387  0.462448  0.920576  5  5.0

In [79]:
df.describe()

              A         B         C    D         F
count  6.000000  6.000000  6.000000  6.0  5.000000
mean  -0.067170  0.009229 -0.033429  5.0  3.000000
std    0.804458  0.448932  1.045195  0.0  1.581139
min   -1.154216 -0.733560 -1.493416  5.0  1.000000
25%   -0.561545 -0.160135 -0.813671  5.0  2.000000
50%   -0.087194  0.044961  0.359473  5.0  3.000000
75%    0.424461  0.360038  0.733396  5.0  4.000000
max    1.050232  0.462448  0.920576  5.0  5.000000

In [80]:
df.mean()

A   -0.067170
B    0.009229
C   -0.033429
D    5.000000
F    3.000000
dtype: float64

In [81]:
df.mean(1)

2013-01-01    0.952395
2013-01-02    1.499922
2013-01-03    1.085760
2013-01-04    1.253212
2013-01-05    2.047818
2013-01-06    2.241727
Freq: D, dtype: float64

In [84]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index = dates)
s

2013-01-01    1.0
2013-01-02    3.0
2013-01-03    5.0
2013-01-04    NaN
2013-01-05    6.0
2013-01-06    8.0
Freq: D, dtype: float64

In [86]:
s.shift(2)

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [87]:
s = s.shift(2)

In [88]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [89]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.190420  5  NaN
2013-01-02  0.565948  0.089923  0.843737  5  1.0
2013-01-03 -1.154216 -0.733560  0.316574  5  2.0
2013-01-04 -0.690598  0.450076 -1.493416  5  3.0
2013-01-05  1.050232 -0.213513  0.402373  5  4.0
2013-01-06 -0.174387  0.462448  0.920576  5  5.0

In [90]:
df.sub(s, axis  ='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -2.154216 -1.733560 -0.683426  4.0  1.0
2013-01-04 -3.690598 -2.549924 -4.493416  2.0  0.0
2013-01-05 -3.949768 -5.213513 -4.597627  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [91]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000 -1.190420   5   NaN
2013-01-02  0.565948  0.089923 -0.346683  10   1.0
2013-01-03 -0.588268 -0.643637 -0.030109  15   3.0
2013-01-04 -1.278866 -0.193561 -1.523526  20   6.0
2013-01-05 -0.228633 -0.407074 -1.121153  25  10.0
2013-01-06 -0.403020  0.055374 -0.200576  30  15.0

In [93]:
df.describe()

              A         B         C    D         F
count  6.000000  6.000000  6.000000  6.0  5.000000
mean  -0.067170  0.009229 -0.033429  5.0  3.000000
std    0.804458  0.448932  1.045195  0.0  1.581139
min   -1.154216 -0.733560 -1.493416  5.0  1.000000
25%   -0.561545 -0.160135 -0.813671  5.0  2.000000
50%   -0.087194  0.044961  0.359473  5.0  3.000000
75%    0.424461  0.360038  0.733396  5.0  4.000000
max    1.050232  0.462448  0.920576  5.0  5.000000

In [94]:
df.apply(lambda x: x.max() - x.min())

A    2.204448
B    1.196008
C    2.413993
D    0.000000
F    4.000000
dtype: float64

In [96]:
(lambda x: x.max() - x.min())(np.array([1, 2, 3, 4]))

3

In [99]:
s = pd.Series(np.random.randint(0, 7, size = 10))
s

0    4
1    6
2    0
3    6
4    2
5    2
6    2
7    0
8    3
9    4
dtype: int64

In [100]:
s.value_counts()

2    3
6    2
4    2
0    2
3    1
dtype: int64